#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/yushin-private/github-actions/runs/run-d1x5Dwo5AhUzEEG8

Waiting for the plan to start...

Terraform v1.0.3
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=mlops-platform-training-data]
module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=mlops-platform-training-data]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.s3_bucket.aws_s3_bucket.this[0] has been changed
  ~ resource "aws_s3_bucket" "this" {
        id                          = "mlops-platform-training-data"
      + tags                        = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_s3_bucket.test_bucket will be created
  + resource "aws_s3_bucket" "test_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "mlops-platform-training-data"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.s3_bucket.aws_s3_bucket.this[0] will be destroyed
  - resource "aws_s3_bucket" "this" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::mlops-platform-training-data" -> null
      - bucket                      = "mlops-platform-training-data" -> null
      - bucket_domain_name          = "mlops-platform-training-data.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "mlops-platform-training-data.s3.ap-southeast-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1WCIGYICN2BYD" -> null
      - id                          = "mlops-platform-training-data" -> null
      - region                      = "ap-southeast-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be destroyed
  - resource "aws_s3_bucket_public_access_block" "this" {
      - block_public_acls       = false -> null
      - block_public_policy     = false -> null
      - bucket                  = "mlops-platform-training-data" -> null
      - id                      = "mlops-platform-training-data" -> null
      - ignore_public_acls      = false -> null
      - restrict_public_buckets = false -> null
    }

Plan: 1 to add, 0 to change, 2 to destroy.


```
</details>
*Pusher: @yushindkang, Action: `pull_request`*